workshopOverkill.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>workshopOverkill</title>
<!-- 2018-11-22 Thu 16:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Magno" />
</head>
<body>
<div id="content">
<h1 class="title">workshopOverkill</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. FUNCTIONS &amp; PARAMETERS</a>
<ul>
<li><a href="#sec-1-1">1.1. 'ONESHOT' FUNCTIONS</a></li>
<li><a href="#sec-1-2">1.2. GLOBAL BEHAVIOUR CHANGING FUNCTIONS</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. <span class="todo TODO">TODO</span> EXAMPLES</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. BLOCKS</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> FUNCTIONS &amp; PARAMETERS</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 'ONESHOT' FUNCTIONS</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>play n
<ul class="org-ul">
<li>ops: attack / release
</li>
</ul>
</li>
<li>sleep n
</li>
<li>sample :foo
<ul class="org-ul">
<li>ops: rate
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-ruby">sample <span style="color: #7fffd4;">:ambi_glass_hum</span>
play 64, <span style="color: #7fffd4;">release:</span> 1.8
<span style="color: #b0c4de;">sleep</span> 0.1
play 63, <span style="color: #7fffd4;">release:</span> 2
play 62, <span style="color: #7fffd4;">release:</span> 3
<span style="color: #b0c4de;">sleep</span> 2
sample <span style="color: #7fffd4;">:ambi_haunted_hum</span>, <span style="color: #7fffd4;">rate:</span> 0.5
play 90, <span style="color: #7fffd4;">attack:</span> 4, <span style="color: #7fffd4;">release:</span> 6
<span style="color: #b0c4de;">sleep</span> 2
play 88, <span style="color: #7fffd4;">attack:</span> 4, <span style="color: #7fffd4;">release:</span> 4
</pre>
</div>

<ul class="org-ul">
<li>size()
</li>
<li>point()
</li>
<li>line()
</li>
<li>rect()
</li>
<li>ellipse()
</li>
</ul>

<div class="org-src-container">

<pre class="src src-processing"><span style="color: #00ffff;">size</span>(400, 400);

<span style="color: #00ffff;">rect</span>(100, 100, 50, 50);
<span style="color: #00ffff;">rect</span>(110, 110, 60, 60);
<span style="color: #00ffff;">rect</span>(120, 120, 80, 80);
<span style="color: #00ffff;">rect</span>(130, 130, 110, 110);
<span style="color: #00ffff;">rect</span>(140, 140, 150, 150);
<span style="color: #00ffff;">rect</span>(150, 150, 200, 200);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> GLOBAL BEHAVIOUR CHANGING FUNCTIONS</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>use<sub>synth</sub>
<ul class="org-ul">
<li>synth specific parameters
</li>
</ul>
</li>
<li>use<sub>synth</sub><sub>defaults</sub>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-ruby">use_synth <span style="color: #7fffd4;">:fm</span>
play 67, <span style="color: #7fffd4;">release:</span> 6, <span style="color: #7fffd4;">depth:</span> 100, <span style="color: #7fffd4;">amp:</span> 0.8

use_synth <span style="color: #7fffd4;">:dsaw</span>
use_synth_defaults <span style="color: #7fffd4;">release:</span> 5, <span style="color: #7fffd4;">detune:</span> 0.2

play 67
play 70
play 74

<span style="color: #b0c4de;">sleep</span> 5

use_synth <span style="color: #7fffd4;">:prophet</span>
use_synth_defaults <span style="color: #7fffd4;">release:</span> 0.2

play 67
<span style="color: #b0c4de;">sleep</span> 0.2
play 70
<span style="color: #b0c4de;">sleep</span> 0.2
play 74
<span style="color: #b0c4de;">sleep</span> 0.2
play 67
play 70
play 74
</pre>
</div>

<ul class="org-ul">
<li>fill()
</li>
<li>stroke()
</li>
<li>strokeWeight()
</li>
<li>noStroke()
</li>
<li>noFill()
</li>
</ul>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> EXAMPLES</h4>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> BLOCKS</h2>
<div class="outline-text-2" id="text-2">
<p>
loop do/end
</p>

<p>
x.times do/end (nesting)
</p>
<div class="org-src-container">

<pre class="src src-ruby">use_bpm 76

16.times <span style="color: #00ffff;">do</span>

  2.times <span style="color: #00ffff;">do</span>
    sample <span style="color: #7fffd4;">:drum_heavy_kick</span>
    <span style="color: #b0c4de;">sleep</span> 0.5
  <span style="color: #00ffff;">end</span>

  sample <span style="color: #7fffd4;">:drum_snare_hard</span>
  <span style="color: #b0c4de;">sleep</span> 1
<span style="color: #00ffff;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Magno</p>
<p class="date">Created: 2018-11-22 Thu 16:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
